//================================================================================
//
//  ███╗   ███╗███████╗██████╗  ██████╗███████╗██████╗ 
//  ████╗ ████║██╔════╝██╔══██╗██╔════╝██╔════╝██╔══██╗
//  ██╔████╔██║█████╗  ██████╔╝██║     █████╗  ██████╔╝
//  ██║╚██╔╝██║██╔══╝  ██╔══██╗██║     ██╔══╝  ██╔══██╗
//  ██║ ╚═╝ ██║███████╗██║  ██║╚██████╗███████╗██║  ██║
//  ╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝ ╚═════╝╚══════╝╚═╝  ╚═╝
//
//--------------------------------------------------------------------------------
//  Author      : Mercer
//  Module      : spram
//  Description : Single-port RAM module
//  Wechat      : zxw895674551
//  Email       : alexmercer@outlook.com
//--------------------------------------------------------------------------------
//  Copyright (c) 2026 Mercer. All rights reserved.
//  Licensed under the MIT License.
//--------------------------------------------------------------------------------
//  Version History:
//  v1.0 - Initial release
//================================================================================
//  Instantiation Template
//================================================================================
/*
spram #(
    .DATA_WIDTH                 (32             ),
    .ADDR_WIDTH                 (32             ))
u_spram (
    .clk                       (clk            ),
    .en                        (en             ),
    .we                        (we             ),
    .din                       (din            ),
    .dout                      (dout           ),
    .addr                      (addr           ));
*/

//================================================================================
//  Module Definition
//================================================================================

module spram #(
    parameter   DATA_WIDTH          = 32,
    parameter   ADDR_WIDTH          = 32
) (
    input                           clk,
    input                           en,
    input                           we,
    input       [DATA_WIDTH-1:0]    din,
    output  reg [DATA_WIDTH-1:0]    dout,
    input       [ADDR_WIDTH-1:0]    addr
);

    reg     [DATA_WIDTH-1:0]        ram [(1<<ADDR_WIDTH)-1:0];

    always @(posedge clk) begin
        if (en & we)
            ram[addr] <= din;
        if (en)
            dout <= ram[addr];
    end

    initial begin : initialization
        integer i;
        for (i = 0; i < (1<<ADDR_WIDTH); i = i + 1) begin
            ram[i] = 0;
        end
    end

endmodule
